Merge pull request #16 from michurin/readme_mermaid
Readme: mermaid flowcharts, cosmetics
